app/views/institutions/_form.html.erb

        <%#= collection_select("institution", "country", { include_blank: 'Select a country' })%>
        <%= collection_select(:institution, :country_id, Country.all, :id, :country_name,
                 {:prompt => 'Please select the country'})%>
---
SELECT `countries`.* FROM `countries`