app/views/students/_form.html.erb

    <div class="col-sm-8">
      <%= form.select :institution_id, options_from_collection_for_select(Institution.all, :id, :name, @student.institution.try(:id)) %>
---
SELECT  `institutions`.* FROM `institutions` WHERE `institutions`.`id` = 4 LIMIT 1

      <%#= country_select("student", "country", { include_blank: 'Select a country' }, { class: 'country-select-box' })%>
     <%= collection_select(:student, :country_id, Country.all,
                  :id, :country_name,
                 {:prompt => 'Please select the country'})%>
---
SELECT `countries`.* FROM `countries`