app/views/students/_student_list.html.erb

                    <td><%= student.institution.name%></td>
                    <td><%= student.country.country_name rescue nil%></td>
---
SELECT `countries`.* FROM `countries`