app/views/students/index.html.erb

SELECT COUNT(*) FROM `students`
SELECT `students`.* FROM `students`
SELECT `countries`.* FROM `countries`
---
      <td>Institution: <%= text_field :student,:institution_search%></td>
      <td>Country: <%= collection_select :student,:country_search,Country.all,'id','country_name',{:prompt => 'All'}%></td>