app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
---
SELECT `institutions`.* FROM `institutions`

  def create
    @institution = Institution.new(institution_params)

    respond_to do |format|
      if @institution.save
---
INSERT INTO `institutions` (`name`, `address`, `phone`, `created_at`, `updated_at`, `country`) VALUES ('Anna University', 'Chennai', '8786867868', '2020-01-26 14:32:06', '2020-01-26 14:32:06', 'IN')

  def update
    respond_to do |format|
      if @institution.update(institution_params)
---
UPDATE `institutions` SET `country` = 'IN', `updated_at` = '2020-01-26 14:13:24' WHERE `institutions`.`id` = 6

  def destroy
    @institution.destroy
---
DELETE FROM `institutions` WHERE `institutions`.`id` = 6

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT  `institutions`.* FROM `institutions` WHERE `institutions`.`id` = 5 LIMIT 1