app/controllers/students_controller.rb

  def index
    @students = Student.all.paginate page:params[:page],per_page:2
---
SELECT  `students`.* FROM `students` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `students`

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`full_name`, `address`, `mobile`, `institution_id`, `created_at`, `updated_at`, `country`) VALUES ('Chaswitha', 'Bangalore', '8888888888', 3, '2020-01-26 13:21:36', '2020-01-26 13:21:36', 'AW')

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE `students` SET `mobile` = '78787878', `institution_id` = 1, `country` = 'AG', `updated_at` = '2020-01-26 13:23:42' WHERE `students`.`id` = 21

  def search_list

   @students = Student.joins(:institution)
   @students = @students.where("institutions.name like '%#{params[:institution]}%'") if not params[:institution].blank?
   @students = @students.where("students.full_name like '%#{params[:full_name]}%'") if not params[:full_name].blank?
   @students = @students.where("students.country_id=?",params[:country_id]) if not params[:country_id].blank?
---
SELECT `students`.* FROM `students` INNER JOIN `institutions` ON `institutions`.`id` = `students`.`institution_id` WHERE (institutions.name like '%South%') AND (students.full_name like '%Norris%')
SELECT COUNT(*) FROM `students` INNER JOIN `institutions` ON `institutions`.`id` = `students`.`institution_id` WHERE (institutions.name like '%south%')

  def update_status
    @student = Student.find_by_id(params[:id])
    if (params[:status] =='Approve')
      @student.update_attributes(:status=>'Approve')
    else
      @student.update_attributes(:status=>'Reject')
    end
    StudentMailer.with(student: @student).status_email.deliver_now
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `status` = 'Reject', `updated_at` = '2020-01-26 11:14:49' WHERE `students`.`id` = 1
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 0 LIMIT 1

    def set_student
      @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 0 LIMIT 1