app/controllers/users_controller.rb

  def verify_login
     @current_user = User.where(:username=>params[:login][:username],:password=>params[:login][:password]).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = '' AND `users`.`password` = '' ORDER BY `users`.`id` ASC LIMIT 1